



if Rails.env == "production"
  p '==================== dish create ===================='
dish_names = ["鮭飯","中華ちまき","リゾット","五目炊き込みご飯（釜飯）","栗ご飯","きのこご飯","タケノコご飯","山菜おこわ","あさりご飯","カレーライス（牛肉）",
"カレーライス（ぶた肉）","チキンカレー","カレー（ナン）","カツカレー","野菜カレー","ハヤシライス","ドライカレー","チャーハン","コーンピラフ","エビピラフ","チキンピラフ",
"オムライス","オムハヤシ","チキンライス","チキンドリア（ライスグラタン","パエリア","ビビンバ中華丼","かにたま丼","マーボ丼","あなご丼","山かけ丼","そぼろ丼","寿司","手巻きずし","お好み焼き（イカ・卵）",
"お好み焼き（豚肉・卵)","もんじゃ焼き","釜あげうどん","ざるうどん","かけうどん","きつねうどん","たぬきうどん","わかめうどん","月見うどん","天ぷらうどん","かき揚げうどん",
"肉うどん","カレーうどん","煮込みうどん","焼きうどん","とろろうどん","山菜うどん","力うどん","おろしうどん","かき揚げそば","肉そば","かけそば","きつねそば","ざるそば",
"たぬきそば","とろろそば","月見そば","鳥南蛮そば","天ぷらそば","冷やしそうめん","にしんそば","山菜そば","おろしそば","ラーメン","タンメン","焼きそば",
"うなぎ丼","親子丼","他人丼","カツ丼","天（えび）丼","天（かき揚げ）丼","牛丼","三色丼","まぐろ丼","スパゲッティナポリタン","スパゲッティミートソース","スパゲッティシーフード",
"スパゲッティボンゴレ","スパゲッティカルボナーラ","スパゲッティペペロンチーノ","きのこスパゲッティ","たらこスパゲッティ","カレー風味スパゲッティ","クリームスパゲッティ",
"コンソメスパゲッティ","マカロニグラタン","ラザーニア","バジリコスパゲッティ","ビーフステーキ","鶏肉のピカタ","焼き豚とキャベツ千切り","ビーフカツ",
"トンカツ","野菜ロールカツ","串カツ（豚肉・玉ねぎ)","串カツ（鶏肉）","鶏肉のから揚げ","鶏肉チーズフライ","チキンカツ","チキンマリネ","ささみフライ","れんこんのはさみ揚げ",
"メンチカツ","ミートボール","ポテトコロッケ","春巻","竜田揚げ","ローストビーフ","牛肉のたたき","ハンバーグ","ミートローフ","ピーマン肉詰め焼き",
"焼き肉（肉と野菜）","肉のみそ漬焼き","肉の塩焼き","ハンバーグの和風ソース添え","焼きぎょうざ","ポークソテー","豚肉の生姜焼き","ハムステーキ",
"アスパラベーコン","ローストチキン","チキンソテー","鶏の照り焼き","焼き鶏","チキングラタン","酢豚豚キムチ","ウスターソース炒め","甘辛炒め牛肉とピーマンの千切り炒め",
"肉と野菜の炒め物","肉とピーマンの炒め物","ひき肉となすの炒め物","レバーと野菜の炒め物","肉の野菜巻き","ロールキャベツ","ビーフシチュー","クリームシチュー","豚肉の角煮",
"蒸しシューマイ","すき焼き","しゃぶしゃぶ","鶏肉の水炊き","キムチ鍋","鶏肉のトマト煮","肉だんご鍋","はりはり鍋","肉と野菜の煮物","バンバンジー",
"鶏レバーの生姜煮","鶏肉のそぼろ煮","蒸し鶏","筑前煮（炒り鶏","かつおのたたき","しめさば","さしみ","魚のカルパッチョ","魚の塩焼き","魚の照り焼き",
"魚のみそ漬","焼き魚のムニエル","白身魚のホイル焼き","いかしょうゆ焼き","ホタテ貝バター焼き","山椒焼き","南蛮焼き","鮭のホイル焼き",
"かにグラタン","たらのチーズ焼き","魚のから揚げ","いわしのしそ揚げ","魚の南蛮漬","魚のマリネ","魚と野菜の天ぷら","天ぷら"
  ]
dish_names.each do |dish_name|
  Dish.create(
    dish_name:dish_name
  )
end

p '==================== admin create ===================='
3.times do |n|
  Admin.create!(
    email: "admin#{n+1}@nyan.com",
    password: "123456"
  )
end
else
  
  p '==================== dish create ===================='
dish_names = ["鮭飯","中華ちまき","リゾット","五目炊き込みご飯（釜飯）","栗ご飯","きのこご飯","タケノコご飯","山菜おこわ","あさりご飯"
  ]
dish_names.each do |dish_name|
  Dish.create(
    dish_name:dish_name
  )
end

p '==================== admin create ===================='
3.times do |n|
  Admin.create!(
    email: "admin#{n+1}@nyan.com",
    password: "123456"
  )
end
  
end